[
  {
    "id": 1,
    "author": {
      "name": "Ahmed Benali",
      "location": "Casablanca, Morocco"
    },
    "rating": 5,
    "comment": "Excellent service! The food was delivered hot and fresh. The delivery was on time and the packaging was perfect. Highly recommend DikaFood for anyone looking for quality Moroccan cuisine.",
    "date": "2024-01-15T10:30:00Z",
    "verified": true
  },
  {
    "id": 2,
    "author": {
      "name": "Fatima Zahra",
      "location": "Rabat, Morocco"
    },
    "rating": 4,
    "comment": "Great experience with DikaFood. The couscous was delicious and the portions were generous. The app is easy to use and the delivery was quick. Will definitely order again!",
    "date": "2024-01-12T14:20:00Z",
    "verified": true
  },
  {
    "id": 3,
    "author": {
      "name": "Youssef Alami",
      "location": "Marrakech, Morocco"
    },
    "rating": 5,
    "comment": "Amazing traditional Moroccan dishes! The tagine was perfectly cooked and the spices were authentic. The customer service was excellent and they accommodated my special dietary requirements.",
    "date": "2024-01-10T18:45:00Z",
    "verified": true
  },
  {
    "id": 4,
    "author": {
      "name": "Amina Tazi",
      "location": "Fez, Morocco"
    },
    "rating": 4,
    "comment": "Very satisfied with my order. The pastilla was crispy and flavorful, just like homemade. The delivery driver was polite and the food arrived in perfect condition.",
    "date": "2024-01-08T12:15:00Z",
    "verified": false
  },
  {
    "id": 5,
    "author": {
      "name": "Karim Mansouri",
      "location": "Tangier, Morocco"
    },
    "rating": 5,
    "comment": "DikaFood exceeded my expectations! The harira soup was authentic and warming, perfect for the cold weather. The app interface is intuitive and the payment process was smooth.",
    "date": "2024-01-05T19:30:00Z",
    "verified": true
  },
  {
    "id": 6,
    "author": {
      "name": "Nadia El Fassi",
      "location": "Agadir, Morocco"
    },
    "rating": 4,
    "comment": "Great quality food and fast delivery. The briouats were crispy and the mint tea was refreshing. The packaging kept everything hot and the presentation was beautiful.",
    "date": "2024-01-03T16:20:00Z",
    "verified": true
  },
  {
    "id": 7,
    "author": {
      "name": "Hassan Berrada",
      "location": "Oujda, Morocco"
    },
    "rating": 5,
    "comment": "Outstanding service! The mechoui was tender and flavorful, exactly as I remember from my grandmother's cooking. The delivery was prompt and the food was still hot when it arrived.",
    "date": "2024-01-01T20:10:00Z",
    "verified": true
  },
  {
    "id": 8,
    "author": {
      "name": "Leila Benjelloun",
      "location": "Tetouan, Morocco"
    },
    "rating": 4,
    "comment": "Very happy with my experience. The rfissa was delicious and the portions were generous. The app is user-friendly and the delivery tracking feature is very helpful.",
    "date": "2023-12-30T13:45:00Z",
    "verified": false
  }
]
